In [57]:
import numpy as np
import pandas as pd
import re

In [62]:
stopwords = {'a', 'an' ,'the', 'of', 'in' , 'on', 'is', 'and', 'from', 'all', 'every', 'everything',
             'but','to','into','below','above','under','over','between','among', 'has', 'about', 'this', 'that',
              'too', 'always', 'there', 'then', 'when', 'how', 'who', 'why', 'what', 'now', 'before', 'after', 'for',
              'can', 'as', 'by', 'it', 'they', 'only', 'its', 'like', 'with', 'you', "you're", 'if', 'be', 'your'}

In [63]:
def preprocess_text(text):

    punctuations = re.compile(r'[,:\'\"\?\!.\n()]')
    preprocessed_text = re.sub(punctuations,'', text)
    #preprocessed_text = re.sub(r"\'s",'', preprocessed_text)
    preprocessed_text = re.sub(r'[\-;]',' ', preprocessed_text)


    return (preprocessed_text.lower())

In [73]:
names = ["Rank", "Nature", "Broadcast", "Flight"]
count = 0
for i in names:
    temp = convert_df(i)
    if count == 0:
        count = count + 1
        final_df = temp
    else:
        final_df = pd.merge(final_df, temp, on = "Words", how = "outer")
final_df = final_df.fillna(0)
final_df.head()

     Words  Rank  Nature  Broadcast  Flight
0  roorkee   1.0     0.0        0.0     0.0
1      air   5.0     4.0        4.0     4.0
2      iit   1.0     0.0        0.0     0.0
3       17   1.0     0.0        0.0     0.0
4     rank   2.0     0.0        0.0     0.0

In [74]:
data = final_df.copy()

In [75]:
nd_rank = 5
nd_nature = 4
nd_flight = 4
nd_broadcast = 4

In [76]:
data["Rank"] = data["Rank"] / nd_rank
data["Nature"] = data["Nature"] / nd_nature
data["Flight"] = data["Flight"] / nd_flight
data["Broadcast"] = data["Broadcast"] / nd_broadcast

data["Tot"] = data["Rank"] + data["Nature"] + data["Flight"] + data["Broadcast"]

data["Rank"] = data["Rank"] / data["Tot"]
data["Nature"] = data["Nature"] / data["Tot"]
data["Flight"] = data["Flight"] / data["Tot"]
data["Broadcast"] = data["Broadcast"] / data["Tot"]

data = data.drop("Tot", axis = 1)

In [77]:
data.head()

     Words  Rank  Nature  Broadcast  Flight
0  roorkee  1.00    0.00       0.00    0.00
1      air  0.25    0.25       0.25    0.25
2      iit  1.00    0.00       0.00    0.00
3       17  1.00    0.00       0.00    0.00
4     rank  1.00    0.00       0.00    0.00

In [79]:
len(data)

159

In [80]:
data.to_csv("prob_term_context.csv", index = False)

In [81]:
check = pd.read_csv("prob_term_context.csv")
check.head()

     Words  Rank  Nature  Broadcast  Flight
0  roorkee  1.00    0.00       0.00    0.00
1      air  0.25    0.25       0.25    0.25
2      iit  1.00    0.00       0.00    0.00
3       17  1.00    0.00       0.00    0.00
4     rank  1.00    0.00       0.00    0.00